tap "1password/tap"
tap "elastic/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Java has to be installed before some other packages
cask "java"
cask "adoptopenjdk8"
brew "openjdk"

# Homebrew packages
brew "ack"
brew "asdf"
brew "autojump"
brew "bash"
brew "curl"
brew "elasticsearch"
brew "elixir"
brew "erlang"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "goreleaser"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mackup"
brew "mas"
brew "mysql"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "plantuml"
brew "postgresql"
brew "python"
brew "redis"
brew "ripgrep"
brew "rustup-init"
brew "sqlite"
brew "starship"
brew "tree"
brew "vim"
brew "vips"
brew "wget"
brew "zsh"

# Casks
cask "1password-beta"
cask "1password-cli"
cask "appcleaner"
cask "bartender"
cask "carbon-copy-cloner"
cask "daisydisk"
cask "docker"
cask "dropbox"
cask "firefox-beta"
cask "flux"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "istat-menus"
cask "iterm2-beta"
cask "little-snitch"
cask "nosql-workbench"
cask "numi"
cask "postman"
cask "raycast"
cask "slack"
cask "stay"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
cask "zsa-wally"

# Mac App Store Apps
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Data Jar", id: 1453273600
mas "Divvy", id: 413857545
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "GoPro Player", id: 1460836908
mas "Hush", id: 1544743900
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "TestFlight", id: 899247664
mas "Vinegar", id: 1591303229
mas "iA Writer", id: 775737590
