tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Java has to be installed before some other packages
cask "java"
cask "adoptopenjdk8"
brew "openjdk"

# Homebrew packages
brew "ack"
brew "autojump"
brew "bash"
brew "curl"
brew "elasticsearch"
brew "elixir"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "gh"
brew "git-lfs"
brew "git"
brew "go"
brew "goreleaser"
brew "hub"
brew "jq"
brew "mackup"
brew "mas"
brew "mysql"
brew "nvim"
brew "pinentry-mac"
brew "plantuml"
brew "postgresql"
brew "python"
brew "rbenv-default-gems"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "sqlite"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"

# Casks
cask "1password"
cask "appcleaner"
cask "bartender"
cask "brave-browser-beta"
cask "dropbox"
cask "firefox-beta"
cask "flux"
cask "font-hack"
cask "gpg-suite"
cask "istat-menus"
cask "iterm2-beta"
cask "little-snitch"
cask "notion"
cask "numi"
cask "quik"
cask "raycast"
cask "rocket"
cask "stay"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"
cask "zsa-wally"

# Mac App Store Apps
mas "AdGuard for Safari", id: 1440147259
mas "Divvy", id: 413857545
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "GoPro Player", id: 1460836908
mas "Hush", id: 1544743900
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Micro Snitch", id: 972028355
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
